[Killed] BlockStatement
src/services/transactionService.ts:6:38
 export class TransactionService {
   constructor(private txModel: TransactionModel) {}
 
-  async findByUserId(userId: string) {
-    return await this.txModel.findByUserId(userId);
-  }
+  async findByUserId(userId: string) {}
 
   // ============================================================================
killedBy: Transaction Service Methods should find by user id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["tx1"]
Received: undefined

[Killed] BlockStatement
src/services/transactionService.ts:18:6
     amount: number;
     currency: string;
     [key: string]: any;
-  }) {
-    // Enforce a strict minimum of $1 to prevent micro-transaction gas/fee losses.
-    if (payload.amount < 1) {
-      throw new Error("Amount too small");
-    }
-
-    // TODO: Proceed with the rest of the withdrawal logic using this.txModel
-    // e.g., return await this.txModel.createTransaction({ ...payload, type: 'WITHDRAWAL' });
-  }
+  }) {}
 }
 
killedBy: Minimum Withdrawal Threshold should reject withdrawals smaller than $1 to save on fees
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/services/transactionService.ts:20:9
     [key: string]: any;
   }) {
     // Enforce a strict minimum of $1 to prevent micro-transaction gas/fee losses.
-    if (payload.amount < 1) {
+    if (payload.amount <= 1) {
       throw new Error("Amount too small");
     }
killedBy: Minimum Withdrawal Threshold should allow withdrawals of exactly $1 or more
statusReason: Error: Amount too small

[Killed] EqualityOperator
src/services/transactionService.ts:20:9
     [key: string]: any;
   }) {
     // Enforce a strict minimum of $1 to prevent micro-transaction gas/fee losses.
-    if (payload.amount < 1) {
+    if (payload.amount >= 1) {
       throw new Error("Amount too small");
     }
killedBy: Minimum Withdrawal Threshold should reject withdrawals smaller than $1 to save on fees
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/services/transactionService.ts:21:23
   }) {
     // Enforce a strict minimum of $1 to prevent micro-transaction gas/fee losses.
     if (payload.amount < 1) {
-      throw new Error("Amount too small");
+      throw new Error("");
     }
 
killedBy: Minimum Withdrawal Threshold should reject withdrawals smaller than $1 to save on fees
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Amount too small"
Received message:   ""

      78 |         } else {
      79 |           stryCov_9fa48("6");
    > 80 |           throw new Error(stryMutAct_9fa48("7") ? "" : (stryCov_9fa48("7"), "Amount too small"));
